/* 班级 学号 姓名 */
#include <iostream>
using namespace std;

/* ----具体要求----
   1、不允许添加其它头文件
   2、不允许定义全局变量、静态局部变量（全局只读变量或宏定义不受此限制）
   3、不允许添加其它函数
   ---------------------------------------------------------------------
*/

#define		N		2
#define		END_NUM		-1

/***************************************************************************
  函数名称：
  功    能：向给定的数组中输入最多n个值（不含-1）
  输入参数：
  返 回 值：
  说    明：input函数中不允许使用全局宏定义N
***************************************************************************/
void input(int* array, const int n)
{
	int* p;  //本函数只允许定义这一个指针变量，不再允许定义任何形式的变量
	p = array;
	for (; p - array < n; p++) {
		cin >> *p;
		if (*p == -1) {
			break;
		}
	}
	*p = -1;
	cin.ignore(63353, '\n');
	/* 函数的实现部分，不允许任何形式的[]出现 */
}

/***************************************************************************
  函数名称：
  功    能：将数组array中的正整数依次输出，每n个一行，不包含最后的-1
  输入参数：
  返 回 值：
  说    明：output函数中不允许使用全局宏定义N
***************************************************************************/
void output(int* array, const int n)
{
	int* p;  //本函数只允许定义这一个指针变量，不再允许定义任何形式的变量
	p = array;
	while (*p != -1) {
		cout << *p << " ";
		p++;
		if ((p - array) % n == 0) {
			cout << endl;
		}
	}
	/* 函数的实现部分，不允许任何形式的[]出现 */
}

/***************************************************************************
  函数名称：
  功    能：将数组a和b去重后合并为c，保持原来的降序不变
  输入参数：
  返 回 值：合并后的数量
  说    明：
***************************************************************************/
int merge(int* a, int* b, int* c)
{
	/* 除这三个变量外，本函数不再运行定义任何形式的变量
		 如果不用，允许删除，但不得增加或替换为其它形式的变量
		包括for(int i=0; )形式的新变量定义同样禁止 */
	int* pa, * pb, * pc;
	pa = a;
	pb = b;
	pc = c;
	while ((*pa != -1) && (*pb != -1)) {
		if (*pa > *pb) {
			*pc = *pa;
			pa++;
			while (*pc == *pa) {
				pa++;
			}
		}
		else if (*pa < *pb) {
			*pc = *pb;
			pb++;
			while (*pc == *pb) {
				pb++;
			}
		}
		else {
			*pc = *pa;
			pa++;
			pb++;
			while (*pc == *pa) {
				pa++;
			}
			while (*pc == *pb) {
				pb++;
			}
		}
		pc++;
	}
	while (*pa != -1) {
		*pc = *pa;
		pa++;
		while (*pc == *pa) {
			pa++;
		}
		pc++;
	}
	while (*pb != -1) {
		*pc = *pb;
		pb++;
		while (*pc == *pb) {
			pb++;
		}
		pc++;
	}
	*pc = -1;
	return pc - c;
	/* 函数的实现部分，不允许任何形式的[]出现 */

}

/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：main不准改动
***************************************************************************/
int main()
{
	int a[N + 1], b[N + 1], c[N * 2 + 1];

	cout << "请输入第1个数组,降序序列,以" << END_NUM << "结束(不含" << END_NUM << ",最多" << N << "个数)" << endl;
	input(a, N); //N表示最多输入N个
	cout << "请输入第2个数组,降序序列,以" << END_NUM << "结束(不含" << END_NUM << ",最多" << N << "个数)" << endl;
	input(b, N);//N表示最多输入N个

	cout << "第1个数组的内容为" << endl;
	output(a, 10); //10表示每行10个
	cout << "第2个数组的内容为" << endl;
	output(b, 15); //15表示每行15个

	int num = merge(a, b, c);
	cout << "合并后数组共" << num << "个元素,具体为" << endl;
	output(c, 25); //25表示每行25个

	return 0;
}

/*
123 123 101 97 83 83 74 65 65 43 37 21 21 16 9 9 5 2 2 1 -1
101 97 97 87 74 67 43 43 35 21 17 10 5 3 2 -1
*/