/* 2352495 信16 张竹和 */
#include <iostream>
using namespace std;

/* ----具体要求----
   1、不允许添加其它头文件
   2、不允许定义全局变量、静态局部变量
   3、不允许添加其它函数
   4、整个程序不允许出现任何形式的循环
   --------------------------------------------------------------------- */


   /***************************************************************************
     函数名称：
     功    能：求num是不是base的幂
     输入参数：
     返 回 值：0 - 不是
               1 - 是
     说    明：函数名、形参、返回类型均不准动
   ***************************************************************************/
int is_power(int num, int base)
{
    //num为十进制整数，base为基数
    int n = 0;
    if (num == 1) {
        return 1;
    }
    if (num == 0 || num % base != 0) {
        return 0;
    }
    n = is_power(num / base, base);
    return n;
}

/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：完成输入、调用递归函数、输出
***************************************************************************/
int main()
{
    //输入
    int num, base, judge;
    cout << "请输入整数num及基数base" << endl;
    cin >> num >> base;
    //输出与函数调用
    cout << num;
    judge = is_power(num, base);
    if (judge == 1)
        cout << "是";
    if (judge == 0)
        cout << "不是";
    cout << base << "的幂" << endl;

    return 0;
}