//两个程序都未处理好，超范围值符号
/* 2352495 张竹和 信16 */
#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>

/* ----具体要求----
   1、不允许添加其它头文件
   2、不允许定义全局变量、静态局部变量
   3、不允许添加其它函数
   4、整个程序不允许出现任何形式的循环
   --------------------------------------------------------------------- */

   /***************************************************************************
	 函数名称：
	 功    能：将整数n分解后输出
	 输入参数：
	 返 回 值：
	 说    明：1、函数名、形参、返回类型均不准动
			   2、不允许使用64位整数
   ***************************************************************************/
void convert(int n)
//输入-2147483648与2147483648均有问题，需做特殊处理
//本题考虑到int型的数据范围-2147483648~2147483647,一种思路是转为负数处理，但本题限制太多，符号不好处理
//另一种方法加特判，2147483648在本编译器中有时会被截断为2147483647，有时会转为-2147483648
{
	if (n >= -2147483647 && n <= 2147483647) {
		if (n < 0) {
			printf("- ");
		}
		if (n == 0) {
			return;
		}
		convert(n / 10);
		printf("%c ", 48 + (n % 10));
		//C语言中int转char的方式1:'0'+int
		//方式2：ASCII码，数字1对应49,二者其实是一种方法
	}
	else {
		if (n < 0) {
			printf("- ");
		}
		if (n == 0) {
			return;
		}
		printf("%c ", 48 - (n / 1000000000) % 10);
		printf("%c ", 48 - (n / 100000000) % 10);
		printf("%c ", 48 - (n / 10000000) % 10);
		printf("%c ", 48 - (n / 1000000) % 10);
		printf("%c ", 48 - (n / 100000) % 10);
		printf("%c ", 48 - (n / 10000) % 10);
		printf("%c ", 48 - (n / 1000) % 10);
		printf("%c ", 48 - (n / 100) % 10);
		printf("%c ", 48 - (n / 10) % 10);
		printf("%c ", 48 - n % 10);
	}
}

/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：main函数不准动
***************************************************************************/
int main()
{
	int n;
	printf("请输入一个整数\n");
	scanf("%d", &n);

	convert(n);
	printf("\n");

	return 0;
}